auto_generated_methods/DependencyGraph.mmd
graph LR
    RawrXD --> BurntToast
    RawrXD_Modular --> _Join_Path__script_RawrXDRootPath__RawrXD_Core
    RawrXD_Modular --> _Join_Path__script_RawrXDRootPath__RawrXD_UI
    SourceDigestionOrchestrator --> _enginePath
    Test_ManifestChangeNotifier --> ManifestChangeNotifier_AutoFeature
    RawrIDE_Integration --> Invoke_CSharpCode
    LiveMetricsDashboard_AutoFeature --> _file
    Build_EXE --> ps2exe
    Test_ProductionReadiness --> _module
    Test_ProductionReadiness --> RawrXD_Core
    Test_ProductionReadiness --> _path
    RawrXD_ProductionDeployment --> _Join_Path__RawrXDRoot__RawrXD_Config
    RawrXD_ProductionDeployment --> _Join_Path__RawrXDRoot__RawrXD_Logging
    RawrXD_ProductionDeployment --> _Join_Path__RawrXDRoot__RawrXD_Core
    RawrXD_ProductionDeployment --> _integratorPath
    RawrXD_backup --> BurntToast
    ManifestTracer --> powershell_yaml
    ManifestChangeNotifier_AutoFeature --> _Name
    SelfHealingModule_AutoFeature_Fixed --> _loggingModule
    SelfHealingModule_AutoFeature_Fixed --> _configModule
    SelfHealingModule_AutoFeature_Fixed --> _file
    RawrXD_Tests --> RawrXD_Logging
    RawrXD_Tests --> RawrXD_Config
    RawrXD_Tests --> RawrXD_Core
    RawrXD_Tests --> RawrXD_UI
    RawrIDE_Integration --> Invoke_CSharpCode
    SelfHealingModule_AutoFeature --> _loggingModule
    SelfHealingModule_AutoFeature --> _configModule
    SelfHealingModule_AutoFeature --> _FilePath
    SelfHealingModule_AutoFeature --> _path
    SelfHealingModule_AutoFeature --> _file
    RawrXD_UniversalIntegrator --> _loggingModule
    RawrXD_UniversalIntegrator --> _configModule
    RawrXD_UniversalIntegrator --> _AIInterventionModule
    RawrXD_UniversalIntegrator --> _file
    RawrXD_UniversalIntegrator --> _analyzer
    DynamicTestHarness_AutoFeature --> _TestFile
    DynamicTestHarness_AutoFeature --> _File
    AutoDependencyGraph_AutoFeature --> statements
    ArchitectureEnhancementEngine --> _ScriptPath
    RawrXD_before_phase2_fixes --> BurntToast
    RawrXD_UI --> _Join_Path__rawrXDRootPath__RawrXD_Logging
    RawrXD_UI --> _Join_Path__rawrXDRootPath__RawrXD_Config
    RawrXD_UI --> _Join_Path__RawrXDRootPath__RawrXD_Logging
    RawrXD_UI --> _Join_Path__RawrXDRootPath__RawrXD_Config
    PluginAutoLoader_AutoFeature --> _modulePath
    RawrXD_backup_20260123_225535 --> BurntToast
    Test_Simple_Opening --> RawrXD
    Invoke_AllAutoGeneratedMethods --> _loggingModule
    Invoke_AllAutoGeneratedMethods --> _configModule
    Invoke_AllAutoGeneratedMethods --> _file
    RawrXD_LegacyManualIntegration --> _script
    Integrate_MissingFeatures --> _file
